//
//  ConstantMarco.h
//  xiaopuwang
//
//  Created by TonyJiang on 2017/7/14.
//  Copyright © 2017年 ings. All rights reserved.
//

#ifndef ConstantMarco_h
#define ConstantMarco_h

#define OrginizationTypeAry @[@"语言类",@"出国类",@"小学/学前类",@"初高中类",@"兴趣类",@"电脑IT类",@"职业技能类",@"学历教育类"]

#define OrginizationImageAry @[@"语言类",@"出国类",@"小学:学前类",@"初高中类",@"兴趣类",@"电脑IT类",@"职业技能类",@"学历教育类"]


#define OrginizationDistrictFilter @[@"智能排序",@"离我最近",@"梁溪区",@"锡山区",@"滨湖区",@"新吴区",@"惠山区"]

#define OrginizationTypeFilter @[@"全部",@"语言类培训课程",@"出国类培训课程",@"学前/小学培训课程",@"初高中培训课程",@"兴趣类培训课程",@"电脑与IT类",@"职业技能类",@"学历教育"]
#define OrginizationTypeSelectFilter @[@"语言类培训课程",@"出国类培训课程",@"学前/小学培训课程",@"初高中培训课程",@"兴趣类培训课程",@"电脑与IT类",@"职业技能类",@"学历教育"]

#define OrginizationSort @[@"销量排名"]

#define OrgDistanceFilter @[@"全城搜索",@"<1km",@"<3km",@"<5km"]

#define MyCellTitle @[@[@""],@[@"账户余额"],@[@"邀请好友下载APP赚红包",@"教育规划",@"培训学校订单",@"我的拼课订单"],@[@"我的关注",@"个人信息",@"设置"]]

#define ShareTitle @"校谱网学费红包-选最合适的学校 领最高全额英才奖学金"
#define ShareDetailTitle @"校谱网学费红包-选最合适的学校 领最高全额英才奖学金"
#define ShareGroupCourseTitle @"我在校谱网参加了拼课活动！快来一起参与吧！"
#define ShareInviteTitle @"快来！校谱网狂送最高888元现金！"

#define EducationTrainingSchoolHeader @[@"请提供学生的情况"]

#define EducationTrainingSchoolTitle @[@"",@"在读几年级？",@"在读哪所学校？",@"想报什么样的培训课程？",@"优先考虑哪里的培训班？",@"联系方式"]

#define EducationTrainingSchoolPlaceHolder @[@"",@"请选择当前就读学校年级",@"请输入就读学校名称",@"请输入",@"请选择地理位置",@"请输入您的手机号",@"请选择自主学习态度"]

#define EducationInternationalSchoolTitle @[@"",@"在读几年级？",@"在读哪所学校？",@"想找哪个城市的国际班/学校？",@"想什么时候转入新的国际班/学校？",@"对国际班/学校的方向是？",@"联系方式"]
#define EducationInternationalSchoolPlaceHolder @[@"",@"请选择当前就读学校年级",@"请输入就读学校名称",@"请选择城市",@"请选择",@"请选择方向",@"请输入您的手机号"]

#define EducationBoardSchoolTitle @[@"",@"在读几年级？",@"在读哪所学校？",@"想去哪个国家留学？",@"对留学国家的州/省/城市有什么要求？",@"有没有特别想去的学校？",@"有没有特别想读的课程/专业？",@"预计什么时候出国留学？",@"有没有出国语言考试成绩？",@"在学校的平均分有多少？",@"联系方式"]

#define EducationBoardSchoolPlaceHolder @[@"",@"请选择当前就读学校年级",@"请输入就读学校名称",@"请选择留学意向",@"请输入要求",@"请输入学校名称",@"请输入课程/专业",@"请选择留学时间",@"是否有出国语言考试",@"请选择平均分",@"请输入您的手机号"]



#define EducationTrainingSchoolPickerData @[@"",@[@"请选择当前就读学校年级",@"小一~小三",@"小四~小六",@"初一~初二",@"初三中考班",@"高一~高二",@"高三高考班",@"大一~大二",@"大三~大四",@"已毕业"]]

#define EducationInternationalPickerData @[@"",@[@"请选择当前就读学校年级",@"小一~小三",@"小四~小六",@"初一~初二",@"初三中考班",@"高一~高二",@"高三高考班",@"大一~大二",@"大三~大四",@"已毕业"],@"",@[@""],@[@"请选择",@"今年9月",@"明年9月",@"后年9月",@"未定"],@[@"请选择方向",@"英语类-英联邦方向（英国/澳大利亚/新加坡/香港）",@"英语类-北美方向（美国/加拿大）",@"日本方向",@"德国方向",@"法国方向",@"意大利方向",@"其他"],@""]

#define EducationBoardPickerData @[@"",@[@"请选择当前就读学校年级",@"小一~小三",@"小四~小六",@"初一~初二",@"初三中考班",@"高一~高二",@"高三高考班",@"大一~大二",@"大三~大四",@"已毕业"],@"",@[@"请选择留学意向",@"美国",@"加拿大",@"英国",@"澳大利亚",@"新加坡",@"日本",@"其他"],@"",@"",@"",@[@"请选择留学时间",@"今年",@"明年",@"后年",@"未定"],@[@"是否有出国语言考试",@"有",@"没有"],@[@"请选择平均分",@"90%以上",@"75~89%",@"60~74%",@"60%以下"],@""]

#define EducationPlanTips @"温馨提示:最好的学校未必是最合适的,最合适的学校才是最好的!"

#define OrgTeacherTitle @[@"顾问老师",@"授课老师",@"学管老师",@"其他老师"]
#define OrgStudentTitle @[@"试听学员",@"在读学员",@"毕业学员",@"其他学员"]

#define ChinaSchoolType @[@"不限",@"幼儿园",@"小学",@"初中",@"高中",@"技术/专科学校",@"大学"]
#define ChinaSchoolNature @[@"不限",@"公立",@"私立"]
#define SchoolGrade @[@"幼儿园",@"小学",@"初一",@"初二",@"初三",@"高一",@"高二",@"高三",@"高中毕业",@"大专专一",@"大专专二",@"大专专三",@"大专毕业",@"本科大一",@"本科大二",@"本科大三",@"本科大四",@"本科毕业",@"硕士在读"]

#define EducationOverSeaCountry @[@"美国",@"加拿大",@"英国",@"澳大利亚",@"新加坡",@"日本",@"其他国家"]

#define PersonChooseSchoolType @[@"教育机构",@"国内学校",@"美国学校",@"加拿大学校",@"英国学校",@"澳大利亚学校",@"新加坡学校",@"日本学校"]

#define PersonChooseChinaCourseType @[@"幼儿园",@"小学",@"初中",@"高中",@"技术/专科学院",@"大学"]

#define MyInfoTitle @[@"姓名:",@"性别:",@"国家:",@"省:",@"市:"]

#define Gender @[@"男",@"女"]

#define MySettingTitle @[@"我的银行卡",@"修改密码",@"清除缓存",@"关于我们",@"退出账号"]

#define MyAboutInfo @" 校谱网正在江苏省无锡市试运营，目前已有300多个培训学校、4所国际学校、2000余所海外学校（美国/加拿大/英国/澳大利亚/新加坡/日本）的招生代表与校谱网建立了官方合作，用户可以通过校谱网App与数千名招生代表进行联系。功能服务</br> 1. 自主选校（用户在选校过程中可以根据自己的需求自主选择，与全品类的培训学校、国际学校、2000余所海外学校的招生代表进行垂直沟通、交流、报名）</br> 2. 专家服务（用户在选校过程中可能存在对教育市场不了解、选校目标不明确、最终定校很纠结等情况，通过PEAR-VIP专家诊断系统，校谱网可以为用户提供第三方专业化的指导建议）</br> 3. 英才奖学金（用户通过校谱网报名培训学校、国际学校或海外学校，都将获得校谱网提供的英才奖学金，最高额度为100%，该英才奖学金可提现至银行卡、微信和支付宝账户）"

#define AddCardTitle @[@[@"请绑定持卡人本人的银行卡"],@[@"持卡人",@"卡号",@"开户行"]]
#define AddCardPlacaholder @[@[@""],@[@"请输入姓名",@"请输入您要绑定的银行卡号",@"请输入开户行"]]
#define CardBGColor @[@[@"0x911F31",@"0xFF595F"],@[@"0xC70007",@"0xFF595F"],@[@"0x21428A",@"0x5C77B1"],@[@"0x067E69",@"0x0BD9b3"],@[@"0x1D2088",@"0x5055E5"],@[@"0xE41E26",@"0xE53B5F"],@[@"0x32487C",@"7CE59F"],@[@"0x641E7C",@"0xBA39E5"],@[@"0xBC1D21",@"0xE55055"],@[@"0x004186",@"0x006FE5"],@[@"0x1D2088",@"0x454AE5"],@[@"0xE50012",@"0xE55C67"],@[@"0xE50012",@"0xE55C67"],@[@"0x0081CC",@"0x45ABE5"],@[@"0x920800",@"0xE0002A"],@[@"0x60B546",@"0x8EE573"],@[@"0xC11E23",@"0xE5454A"],@[@"0x0035D9",@"0x2E5CE5"],@[@"0x007E3E",@"0x00BF6C"]]
#define AddCardBankName @[@"中国银行",@"中国工商银行",@"中国建设银行",@"中国农业银行",@"交通银行",@"招商银行",@"中国民生银行",@"中国光大银行",@"中信银行",@"兴业银行",@"上海浦东发展银行",@"中国人民银行",@"华夏银行",@"深圳发展银行",@"广发银行",@"中国农业发展银行",@"北京银行",@"上海银行",@"中国邮政储蓄银行"]

#define ConfirmOrderTitle @[@"订单号",@"课程名称",@"买家账号",@"学生姓名",@"选择红包"]
#define DealOrderTitle @[@"订单号",@"课程名称",@"实际价格",@"买家账号",@"学生姓名",@"支付方式"]

#define PayType @[@"线上支付",@"线下支付"]

#define EvaluateTag @[@"好评",@"中评",@"差评"]

#define CouponIntro @"1. 抵用券仅限在线支付学费时候使用,支付学费0-1000元可使用1张抵用券,1001-5000元可使用2张抵用券,学费超过5000元可使用3张抵用券.\n2. 获得的抵用券可赠送给好友,赠送后抵用券自动消失. \n3. 本抵用券的最终解释权归校谱网所有. "

#define SearchFilter @[@"机构",@"学校",@"课程"]

#define UserIdentityType @[@"我是家长",@"我是学生"]

#define HomeSelectTitle @[@"培训机构",@"国际学校",@"海外学校"]
#define HomeSelectSecondTitle @[@"学前小学",@"初高中",@"兴趣类",@"语言类",@"出国类",@"电脑IT",@"职业资格",@"学历教育"]
#define InterSchoolTitle @[@"幼儿园",@"小学",@"初中",@"高中",@"大学",@"技术/专科学院"]
#define OverSeaSchoolTitle @[@"澳大利亚",@"加拿大",@"美国",@"日本",@"新加坡",@"英国"]

#define GroupCourseExplain @"邀请好友参加拼课活动，在规定时间内凑齐人数则拼课成功，若未凑齐人数则拼课失败全额退款,并附送校谱网50元通用红包券一张。"
#define GroupCourseInfoTitle @[@"姓名",@"手机号"]
#define GroupCourseInfoPlaceholder @[@"请输入您的姓名",@"请输入您的联系方式"]

#define WalletTitle @[@"",@[@"现金红包",@"申请提现"],@[@"银行卡"]]

#define InviteRule @"1.将当前页面分享给您未下载过校谱网App的好友，好友通过您分享的链接进入应用商店下载最新版校谱网App，并注册登录（点击邀请链接的24小时内）后，您即可获得最高20-888元现金红包；\n2.红包发放时间：每日7:00 - 16:59期间邀请好友下载App并完成注册登录，将于当日21:00发券；每日17:00 - 06:59（次日）期间邀请成功，将于次日12:00发券；\n3.现金红包适用于培训学校课程，有效期为60天；\n4.每位用户每天可邀请的新用户，如发现用户存在违规行为（包括但不限于恶意刷券、套现等作弊行为），校谱网有权将违规红包进行作废处理，并取消其“邀请赚现金红包”的资格；\n5.校谱网可以对活动时间和活动规则作出调整，请注意活动页面相关说明；\n6.校谱网可在法律允许的范围内对本活动规则进行解释；"

#define GroupCourseHomeShareTitle @"嗨，我正在校谱网参与拼课活动！里面优惠很多！一起来看看吧！"
#define GroupCourseHomeShareDes @"校谱网APP是一款教育类APP应用，截止目前已有300余所各个课程品类的培训学校入驻校谱网"

#define EducationPlanShareTitle @"【校谱网】专家帮你选好学校，大数据帮你分析推荐优质学校"
#define EducationPlanShareDesc @"【校谱网】最好的学校未必是最合适的，最合适的学校才是最好的！"
#endif /* ConstantMarco_h */
