//
//  ConstantMarco.h
//  xiaopuwang
//
//  Created by TonyJiang on 2017/7/14.
//  Copyright © 2017年 ings. All rights reserved.
//

#ifndef ConstantMarco_h
#define ConstantMarco_h

#define OrginizationTypeAry @[@"语言类",@"出国类",@"小学/学前类",@"初高中类",@"兴趣类",@"电脑IT类",@"职业技能类",@"学历教育类"]

#define OrginizationImageAry @[@"语言类",@"出国类",@"小学:学前类",@"初高中类",@"兴趣类",@"电脑IT类",@"职业技能类",@"学历教育类"]


#define OrginizationDistrictFilter @[@"智能排序",@"离我最近",@"梁溪区",@"锡山区",@"滨湖区",@"新吴区",@"惠山区"]

#define OrginizationTypeFilter @[@"全部",@"语言类",@"出国类",@"小学/学前类",@"初高中类",@"兴趣类",@"电脑IT类",@"职业技能类",@"学历教育类"]

#define OrginizationSort @[@"距离排名"]

#define OrgDistanceFilter @[@"全城搜索",@"<1km",@"<3km",@"<5km"]

#define MyCellTitle @[@[@""],@[@"培训学校订单"],@[@"我的钱包",@"我的优惠券",@"公益基金"],@[@"我的关注",@"教育规划受理状态",@"邀请好友",@"个人信息",@"设置"]]

#define ShareTitle @"校谱网学费红包-选最合适的学校 领最高全额学费补贴"
#define ShareDetailTitle @"校谱网学费红包-选最合适的学校 领最高全额学费补贴"

#define EducationTrainingSchoolHeader @[@"请提供学生的情况",@"请提供家庭教育的情况"]
#define EducationInternationalSchoolHeader @[@"请提供学生的情况",@"请提供您的核心需求"]

#define EducationTrainingSchoolTitle @[@"",@"姓名",@"性别",@"性格",@"在读哪个年级",@"学校的学习氛围",@"自主学习态度",@"学习成绩",@"对什么比较感兴趣",@"是否在读培训课程",@"",@"每天用多少时间关心孩子教育",@"与孩子沟通学习的频率",@"比较关注孩子哪方面的学习内容",@"需求备注"]

#define EducationTrainingSchoolPlaceHolder @[@"",@"请填写您的真实姓名",@"请选择性别",@"请选择性格",@"请选择在读哪个年级",@"请选择学校的学习氛围",@"请选择自主学习态度",@"请选择学习成绩",@"您可输入感兴趣的课程或内容",@"请输入培训机构课程；没有填否",@"",@"请选择每天用多少时间关心孩子教育",@"请选择与孩子沟通学习的频率",@"请选择比较关注孩子哪方面的学习内容",@"请输入需求备注"]

#define EducationInternationalSchoolTitle @[@"",@"姓名",@"性别",@"性格",@"目前在读年级",@"英语成绩",@"数学成绩",@"是否参加过国际考试",@"",@"国际课程年级意向",@"国际课程国家意向",@"留言"]

#define EducationInternationalForeignScore @[@"90~100 %",@"75~89 %",@"60~74 %",@"60%以下"]

#define EducationInternationalSchoolPlaceHolder @[@"",@"请填写您的真实姓名",@"请选择性别",@"请选择性格",@"请选择在读年级",@"请选择您的英语成绩",@"请选择您的数学成绩",@"是（请输入考试名称：成绩）；没有填否",@"",@"请选择国际课程意向年级",@"请选择国际课程国家方向",@"请填写留言信息"]

#define EducationBoardSchoolTitle @[@"",@"姓名",@"性别",@"性格",@"在读哪个年级",@"英语成绩怎么样",@"在校各科目平均分均值有多少",@"在校有没有参与课外实践活动",@"是否参加过国际考试",@"",@"意向留学国家（多选）",@"意向留学年级",@"预计出国时间",@"留言"]

#define EducationBoardSchoolPlaceHolder @[@"",@"请填写您的真实姓名",@"请选择性别",@"请选择性格",@"请选择在读哪个年级",@"请选择您的英语成绩",@"请选择在校各科目平均分均值有多少",@"请选择在校有没有参与课外实践活动",@"是否参加过国际考试",@"",@"",@"意向留学年级",@"预计出国时间",@"请输入需求备注"]

#define EducationTrainingSchoolPickerData @[@"",@"",@[@"男",@"女"],@[@"外向",@"内向"],@[@"学前",@"初一~初三",@"小一~小六",@"初一~初三",@"高一~高三",@"大一~大四",@"已毕业"],@[@"学校的学习氛围非常好",@"学习氛围一般",@"不满意学校的学习氛围"],@[@"主动学习",@"有人看着才会学习",@"有人看着也不会高质量自学"],@[@"学校名列前茅",@"在校属于中等生",@"在校成绩不理想"],@"",@"",@"",@[@"小于1小时",@"1~3小时",@"更长时间"],@[@"一周5次或以下",@"一周6~10次",@"一周10次以上"],@[@"只关心作业完成情况",@"除了作业，根据孩子的兴趣进行培养",@"除了作业，根据自己对教育的判断培养孩子"]]

#define EducationInternationalPickerData @[@"",@"",@[@"男",@"女"],@[@"外向",@"内向"],@[@"幼一~幼三",@"初一~初三",@"小一~小六",@"初一~初三",@"高一~高三",@"大一~大四",@"已毕业"],@[@"90~100 %",@"75~89 %",@"60~74 %",@"60%以下"],@[@"90~100 %",@"75~89 %",@"60~74 %",@"60%以下"],@"",@"",@[@"幼儿园",@"小学",@"初中",@"高中",@"大学"],@[@"美国方向",@"加拿大方向",@"英澳新方向",@"日本方向",@"意德法荷方向",@"其他方向"]]

#define EducationBoardPickerData @[@"",@"",@[@"男",@"女"],@[@"外向",@"内向"],@[@"幼一~幼三",@"初一~初三",@"小一~小六",@"初一~初三",@"高一~高三",@"大一~大四",@"已毕业"],@[@"90~100 %",@"75~89 %",@"60~74 %",@"60%以下"],@[@"90~100 %",@"75~89 %",@"60~74 %",@"60%以下"],@[@"有",@"没有"],@"",@"",@[@"美国",@"加拿大",@"英国",@"澳大利亚",@"新加坡",@"日本",@"其他国家"],@[@"幼儿园",@"小学",@"初中",@"高中",@"大学"],@[@"6个月之内",@"7~12个月",@"1~2年",@"2年以上"]]

#define EducationPlanTips @"温馨提示:最好的学校未必是最合适的,最合适的学校才是最好的!"

#define OrgTeacherTitle @[@"顾问老师",@"授课老师",@"学管老师",@"其他老师"]
#define OrgStudentTitle @[@"试听学员",@"在读学员",@"毕业学员",@"其他学员"]

#define ChinaSchoolType @[@"不限",@"幼儿园",@"小学",@"初中",@"高中",@"技术/专科学校",@"大学"]
#define ChinaSchoolNature @[@"不限",@"公立",@"私立"]
#define SchoolGrade @[@"幼儿园",@"小学",@"初一",@"初二",@"初三",@"高一",@"高二",@"高三",@"高中毕业",@"大专专一",@"大专专二",@"大专专三",@"大专毕业",@"本科大一",@"本科大二",@"本科大三",@"本科大四",@"本科毕业",@"硕士在读"]

#define EducationOverSeaCountry @[@"美国",@"加拿大",@"英国",@"澳大利亚",@"新加坡",@"日本",@"其他国家"]

#define PersonChooseSchoolType @[@"教育机构",@"国内学校",@"美国学校",@"加拿大学校",@"英国学校",@"澳大利亚学校",@"新加坡学校",@"日本学校"]

#define PersonChooseChinaCourseType @[@"幼儿园",@"小学",@"初中",@"高中",@"技术/专科学院",@"大学"]

#define MyInfoTitle @[@"姓名:",@"性别:",@"国家:",@"省:",@"市:"]

#define Gender @[@"男",@"女"]

#define MySettingTitle @[@"我的银行卡",@"修改密码",@"清除缓存",@"关于我们",@"退出账号"]

#define MyAboutInfo @" 校谱网正在江苏省无锡市试运营，目前已有300多个培训学校、4所国际学校、2000余所海外学校（美国/加拿大/英国/澳大利亚/新加坡/日本）的招生代表与校谱网建立了官方合作，用户可以通过校谱网App与数千名招生代表进行联系。功能服务</br> 1. 自主选校（用户在选校过程中可以根据自己的需求自主选择，与全品类的培训学校、国际学校、2000余所海外学校的招生代表进行垂直沟通、交流、报名）</br> 2. 专家服务（用户在选校过程中可能存在对教育市场不了解、选校目标不明确、最终定校很纠结等情况，通过PEAR-VIP专家诊断系统，校谱网可以为用户提供第三方专业化的指导建议）</br> 3. 学费现金补贴（用户通过校谱网报名培训学校、国际学校或海外学校，都将获得校谱网提供的学费现金补贴，最高额度为100%，该现金补贴可提现至银行卡、微信和支付宝账户）"

#define AddCardTitle @[@[@"请绑定持卡人本人的银行卡"],@[@"持卡人",@"卡号",@"开户行"]]
#define AddCardPlacaholder @[@[@""],@[@"请输入姓名",@"请输入您要绑定的银行卡号",@"请输入开户行"]]
#define CardBGColor @[@[@"0x911F31",@"0xFF595F"],@[@"0xC70007",@"0xFF595F"],@[@"0x21428A",@"0x5C77B1"],@[@"0x067E69",@"0x0BD9b3"],@[@"0x1D2088",@"0x5055E5"],@[@"0xE41E26",@"0xE53B5F"],@[@"0x32487C",@"7CE59F"],@[@"0x641E7C",@"0xBA39E5"],@[@"0xBC1D21",@"0xE55055"],@[@"0x004186",@"0x006FE5"],@[@"0x1D2088",@"0x454AE5"],@[@"0xE50012",@"0xE55C67"],@[@"0xE50012",@"0xE55C67"],@[@"0x0081CC",@"0x45ABE5"],@[@"0x920800",@"0xE0002A"],@[@"0x60B546",@"0x8EE573"],@[@"0xC11E23",@"0xE5454A"],@[@"0x0035D9",@"0x2E5CE5"],@[@"0x007E3E",@"0x00BF6C"]]
#define AddCardBankName @[@"中国银行",@"中国工商银行",@"中国建设银行",@"中国农业银行",@"交通银行",@"招商银行",@"中国民生银行",@"中国光大银行",@"中信银行",@"兴业银行",@"上海浦东发展银行",@"中国人民银行",@"华夏银行",@"深圳发展银行",@"广发银行",@"中国农业发展银行",@"北京银行",@"上海银行",@"中国邮政储蓄银行"]
#endif /* ConstantMarco_h */
